sbhakim/IoT_with_nRF52/lab_7_ble/main.c
/*
* Function for generating a dummy temperature information packet.
*/
static void generate_temperature(ble_hts_meas_t * p_meas)
{
    static ble_date_time_t time_stamp = { 2017, 15, 11, 16, 15, 0 };

    uint32_t celciusX100;

    p_meas->temp_in_fahr_units = false;
    p_meas->time_stamp_present = true;
    p_meas->temp_type_present = (TEMP_TYPE_AS_CHARACTERISTIC ? false : true);
    celciusX100 = 2000+hts_counter++; // one unit is 0.01 Celcius
    p_meas->temp_in_celcius.exponent = -2;
    p_meas->temp_in_celcius.mantissa = celciusX100;
    p_meas->temp_in_fahr.exponent = -2;
    p_meas->temp_in_fahr.mantissa = (32 * 100) + ((celciusX100 * 9) / 5);
    p_meas->time_stamp = time_stamp;
    p_meas->temp_type = BLE_HTS_TEMP_TYPE_FINGER;
    // update simulated time stamp
 
       time_stamp.seconds += 27;
    if (time_stamp.seconds > 59)
     {
        time_stamp.seconds -= 60;
        time_stamp.minutes++;
         if (time_stamp.minutes > 59)
         {
             time_stamp.minutes = 0;
        }
    }
}

/* ------------ added_by_safayat -------------------- */


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/* ------------ added_by_safayat -------------------- */

static void temperature_measurement_send(void)
{
 ble_hts_meas_t hts_meas; //Health Thermometer Service measurement structure
 ret_code_t err_code;
    if (!m_hts_meas_ind_conf_pending)
    {
        generate_temperature(&hts_meas);

        err_code = ble_hts_measurement_send(&m_hts, &hts_meas);
        
        switch (err_code)
        {
             case NRF_SUCCESS:
             // Measurement was successfully sent, wait for confirmation.
                 m_hts_meas_ind_conf_pending = true;
                 break;
            
             case NRF_ERROR_INVALID_STATE:
            // Ignore error.
                break;
            
            default:
                APP_ERROR_HANDLER(err_code);
                break;
         }
    }
}


/*
* Function for handling the Health Thermometer Service events.
*/
static void on_hts_evt(ble_hts_t * p_hts, ble_hts_evt_t * p_evt)
{
     switch (p_evt->evt_type)
    {
        case BLE_HTS_EVT_INDICATION_ENABLED:
            // Indication has been enabled, send a single temperature measurement
            temperature_measurement_send();
            break;
        case BLE_HTS_EVT_INDICATION_CONFIRMED:
            m_hts_meas_ind_conf_pending = false;
            break;
        default:
            // No implementation needed.
            break;
     }
}


/* ------------ added_by_safayat -------------------- */

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    /* ------------ added_by_safayat --------------------*/
    ret_code_t err_code;
    ble_hts_init_t hts_init;
    ble_bas_init_t bas_init;
    
    // Initialize Health Thermometer Service
    memset(&hts_init, 0, sizeof(hts_init));
    
    hts_init.evt_handler = on_hts_evt;
    hts_init.temp_type_as_characteristic = TEMP_TYPE_AS_CHARACTERISTIC;
    hts_init.temp_type = BLE_HTS_TEMP_TYPE_BODY;
    
    // Here the sec level for the Health Thermometer Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&hts_init.hts_meas_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&hts_init.hts_meas_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&hts_init.hts_meas_attr_md.write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&hts_init.hts_temp_type_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&hts_init.hts_temp_type_attr_md.write_perm);
    
    err_code = ble_hts_init(&m_hts, &hts_init);
    APP_ERROR_CHECK(err_code);
    
    
    // Initialize Battery Service.


    memset(&bas_init, 0, sizeof(bas_init));
    // Here the sec level for the Battery Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);
    bas_init.evt_handler = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref = NULL;
    bas_init.initial_batt_level = 100;
    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

    /* ------------ added_by_safayat --------------------*/
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

